UTAF_Base/requestFiles/BPS_Product Group_Create.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:v4.context.vss.objects.bgc" xmlns:urn1="urn:v1.productgroup.bps.services.bgc" xmlns:urn2="urn:v1.crdmodel.bps.objects.bgc">
   <soapenv:Header>
      <urn:Context version="4.0">
         <urn:correlationId>${Req_corrId}</urn:correlationId>
         <urn:consumerApplicationId>BPS</urn:consumerApplicationId>
         <urn:endUserId>id058127</urn:endUserId>
         <urn:endUserLanguage>EN</urn:endUserLanguage>
         <urn:propagatedKey>${Req_propagatedKey}</urn:propagatedKey>
      </urn:Context>
   </soapenv:Header>
   <soapenv:Body>
      <urn1:RequestDataCreate version="1.2">
         <urn1:userContext>
            <urn2:applicationNm>BPS</urn2:applicationNm>
            <urn2:correlationId>${Req_corrId}</urn2:correlationId>
            <urn2:userId>id058127</urn2:userId>
            <urn2:languageIso2Code>EN</urn2:languageIso2Code>
         </urn1:userContext>
         <urn1:name>Test AutoCDB ${Req_name}</urn1:name>
         
         <urn1:startDate>${Req_startDate}</urn1:startDate>
         
         <urn1:endDate>${Req_endDate}</urn1:endDate>
         
         <urn1:comment>${Req_comment}</urn1:comment>
      </urn1:RequestDataCreate>
   </soapenv:Body>
</soapenv:Envelope>
